In [1]:
import pandas as pd

In [4]:
read_file = pd.read_csv("test_data.csv")    # access a csv from home folder
read_file

   Name  Age     Type
0   Roy   20      Web
1   Ray   21      App
2  Sean   22       EH
3   Dan   23  Network
4   NaN   24       CP

In [5]:
read_file["Name"]     # access cols

0     Roy
1     Ray
2    Sean
3     Dan
4     NaN
Name: Name, dtype: object

In [6]:
read_file["Name"][4] = "Jay"    # change a data

C:\Users\RAJARSHI RAY\AppData\Local\Temp\ipykernel_42028\2873636904.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  read_file["Name"][4] = "Jay"

In [11]:
read_file.head()     # view changes

        Name  Age     Type
First    Roy   20      Web
Second   Ray   21      App
Third   Sean   22       EH
Fourth   Dan   23  Network
Fifth    Jay   24       CP

In [ ]:
read_file.index = ["First","Second","Third","Fourth","Fifth"]    # set manual index

## Series & DataFrame

In [16]:
# Series and DataFrame

list_ser = [1,2,3,4]
dict_df = {
    "Name" : ["AR","BR","CR","DR"],
    "Age"  : [20,21,22,23],
    "City" : ["AX","BX","CX","DX"]
}

In [18]:
series = pd.Series(list_ser,index=["First","Second","Third","Fourth"])
series      # Series with index

First     1
Second    2
Third     3
Fourth    4
dtype: int64

In [23]:
dataframe_new = pd.DataFrame(dict_df)     # dataframe with index
dataframe_new.index = ["First","Second","Third","Fourth"]
dataframe_new.head()

       Name  Age City
First    AR   20   AX
Second   BR   21   BX
Third    CR   22   CX
Fourth   DR   23   DX

## LOC & ILOC

In [24]:
read_file.head()

        Name  Age     Type
First    Roy   20      Web
Second   Ray   21      App
Third   Sean   22       EH
Fourth   Dan   23  Network
Fifth    Jay   24       CP

In [27]:
read_file.loc["First" , "Type"]    # loc used to access table based on their actual row and col name

'Web'

In [29]:
# to change a certain part use through loc or iloc
# changing Ray's Type to SDE
read_file.loc["Second","Type"] = "SDE"
read_file.head()

        Name  Age     Type
First    Roy   20      Web
Second   Ray   21      SDE
Third   Sean   22       EH
Fourth   Dan   23  Network
Fifth    Jay   24       CP

In [31]:
read_file.drop("Second",axis=0)    # remove row second

        Name  Age     Type
First    Roy   20      Web
Third   Sean   22       EH
Fourth   Dan   23  Network
Fifth    Jay   24       CP

In [33]:
read_file.drop("Name",axis=1)     # remove Name column

        Age     Type
First    20      Web
Second   21      SDE
Third    22       EH
Fourth   23  Network
Fifth    24       CP

In [34]:
read_file.head()

        Name  Age     Type
First    Roy   20      Web
Second   Ray   21      SDE
Third   Sean   22       EH
Fourth   Dan   23  Network
Fifth    Jay   24       CP

In [36]:
read_file.iloc[0,1]      # indexed based loc

20

In [38]:
read_file.iloc[2,2] = "App"    # changing Sean EH to App
read_file.head()

        Name  Age     Type
First    Roy   20      Web
Second   Ray   21      SDE
Third   Sean   22      App
Fourth   Dan   23  Network
Fifth    Jay   24       CP

## DropNA - checks na values

In [40]:
edit_data = pd.read_csv("test_data.csv")
edit_data

   Name   Age     Type
0   Roy  20.0      Web
1   Ray   NaN      App
2  Sean  22.0       EH
3   Dan   NaN  Network
4   NaN  24.0       CP

In [41]:
edit_data.dropna()

   Name   Age Type
0   Roy  20.0  Web
2  Sean  22.0   EH

In [43]:
edit_data.isnull()    # checks null vals

    Name    Age   Type
0  False  False  False
1  False   True  False
2  False  False  False
3  False   True  False
4   True  False  False